Feature: Управление на класове

  Background: Отваряне на приложението
    Given Потребителят е влезнал в системата
    When потребителят натиска бутона Добави
    

  Scenario: Успешно добавяне на клас
    When потребителят въвежда в полето "6 клас"    
    Then системата извежда съобщение "Записът беше добавен успешно!"

  Scenario: Опит за добавяне на клас без име
    When потребителят въвежда в полето ""
    Then системата извежда съобщение "Изглежда, че не сте добавили необходимата информация. Моля, опитайте отново!"

  Scenario: Опит за добавяне на клас със забранени символи
    When потребителят въвежда в полето "8_клас@@@"
    Then системата извежда съобщение "Името на класа не може да съсържа символите ';_@$%€'!"

  Scenario: Опит за добавяне на клас, чието име надхвърля 20 символа
    When потребителят въвежда в полето "клас123456789клас123456789"
    Then системата извежда съобщение "Името на класа трябва да е с дължина под 20 символа!"

  Scenario Outline: Опит за добавяне на клас с невалидни данни
    When потребителят въвежда в полето "<забранени символи>"
    And потребителят въвежда в полето "<надхвърля 20 символа>"
    Then системата извежда съобщение "съобщение"
    Examples:
    |без забранени символи|под 20 символа | съобщение
    |да                   | да            | "Записът беше добавен успешно!"
    |да                   | не            | "Името на класа трябва да е с дължина под 20 символа!"
    |не                   | да            | "Името на класа не може да съсържа символите ';_@$%€'!!"
    |не                   | не            | "Името на класа не може да съсържа символите ';_@$%€'! То трябва да е с дължина под 20 символа!"