Feature: Визуализиране на създадените тестове

  Background: Отваряне на приложението
    Given отваряне на приложението
    And поребителят е в началния екран на приложението
    When потребителят отваря началния екран на приложението
    And натиска бутона за търсене

  Scenario: Потребителят е влезнал в системата и вижда всички публични тестове, както и тези, които са споделени с него
    Given Потребителят е влезнал в системата
    Then системата визуализира всички публични тестове, както и тези, които са споделени с потребителя
   
  Scenario: Потребителят не е влезнал в системата и вижда само публичните тестове
    Given потребителят не е влезнал в системата
    Then системата визуализира всички публични тестове
  
  Scenario: Потребителят избира от менюто клас и вижда всички тестове за съответния клас
    When потребителят избира "8 клас" от менюто за класове
    Then системата визуализира всички тестове за 8 клас
    
    Scenario: Потребителят избира от менюто предмет и вижда всички тестове за съответния предмет
   #Given потребителят е в началния екран на приложението
    When потребителят избира "Български език" от менюто за предмети
    Then системата визуализира всички тестове по "Български език"
    
    Scenario: Отваряне на начален екран с тестове с търсене по име на тест
    When потребителят въвежда име на теста "име" в полето за търсене
    Then визуализира списък с тестовете, отговарящи на търсенето
    
    Examples:
    |  въведено име                  |  брой  |
    |   "Правописна норма"           |  1     |
    |   " "                          |  6     |
    |   "математика"                 |  0     |
    
